
# 530. 二叉搜索树的最小绝对差

"""

本题要求二叉搜索树任意两节点差的绝对值的最小值，而我们知道二叉搜索树有个性质为二叉搜索树中序遍历得到的值序列是递增有序的，因此我们只要得到中序遍历后的值序列即能用上文提及的方法来解决。

朴素的方法是经过一次中序遍历将值保存在一个数组中再进行遍历求解。

我们也可以在中序遍历的过程中用 pre 变量保存前驱节点的值，这样即能边遍历边更新答案，不再需要显式创建数组来保存，需要注意的是 pre 的初始值需要设置成任意负数标记开头，下文代码中设置为 −1。



"""

def getMinimumDifference(root):

    """

    本质是二叉树的中序遍历

    """
    pre, ans = -1, 10**5

    def dfs(node):
        if node is None:
            return
        nonlocal pre, ans
        dfs(node.left)  # 左
        # 中序遍历整体是有序的，那么在遍历到第一个值时，不做差值计算，仅记录；
        # 遍历到第二个值时，再做差值计算，并更新最小值，然后记录当前值，遍历下一个；
        if pre != -1: ans = min(ans, node.val - pre)
        pre = node.val
        dfs(node.right)  # 右

    dfs(root)
    return ans


