
# 96. 不同的二叉搜索树

class Solution:

    def numTrees(self, n: int) -> int:

        """

        - 设 `G(n)` 表示由 `n` 个节点组成的不同二叉搜索树的种数。

        - F(i,n): 以 i 为根、序列长度为 n 的不同二叉搜索树个数 (1≤i≤n)。

        - 对于一个二叉搜索树，以 `i` 为根节点时，左子树有 `i-1` 个节点，右子树有 `n-i` 个节点。

            - 因此，`G(n)` 可以表示为：

                G(n): 累加：F(i,n)

                F(i,n): G(i−1) ⋅ G(n−i)

                G(n): 累加(1-n)：G(i−1) × G(n−i)


        - 使用动态规划数组 `dp`，其中 `dp[i]` 表示 `G(i)`。

        - 初始化 `dp[0] = 1` 和 `dp[1] = 1`。

        - 通过双重循环计算 `dp[i]`，外层循环遍历节点数 `i`，内层循环遍历根节点 `j`。

        """

        """
        
        定义状态：

            dp[i] 表示节点数为 i 的不同二叉搜索树的数量。
            
            初始状态：
            
                dp[0] = 1：当没有节点时，只有一种空树。
                dp[1] = 1：当只有一个节点时，只有一种单节点树。
            状态转移：
            
                对于节点数 i，尝试每一个可能的节点作为根节点。
                设根节点为 j（1 <= j <= i），那么：
                左子树有 j - 1 个节点。
                右子树有 i - j 个节点。
                所以，左子树和右子树的组合数是 dp[j - 1] * dp[i - j]。
                因为不同的根节点会产生不同的树形结构，需要将这些组合数累加到 dp[i]。
            最终结果：
            
                 dp[n] 就是节点数为 n 的所有不同二叉搜索树的数量。

        
        """

        dp = [0] * (n + 1)

        dp[0], dp[1] = 1, 1

        for i in range(2, n + 1):

            # for j in range(1, n + 1):
            #     dp[i] += dp[i - 1] * dp[n - i]

            for j in range(1, i + 1):
                dp[i] += dp[j - 1] * dp[i - j]

        return dp[n]





