
# 31 下一个排列

# 例如，arr = [1,2,3] 的下一个排列是 [1,3,2] 。
# 类似地，arr = [2,3,1] 的下一个排列是 [3,1,2] 。
# 而 arr = [3,2,1] 的下一个排列是 [1,2,3] ，因为 [3,2,1] 不存在一个字典序更大的排列。


def nextPermutation(nums):
    """
    :type nums: List[int]
    :rtype: None Do not return anything, modify nums in-place instead.
    """

    """
    
    算法推导
    
    如何得到这样的排列顺序？这是本文的重点。我们可以这样来分析：
    
    我们希望下一个数 比当前数大，这样才满足 “下一个排列” 的定义。因此只需要 将后面的「大数」与前面的「小数」交换，就能得到一个更大的数。比如 123456，将 5 和 6 交换就能得到一个更大的数 123465。
    
    我们还希望下一个数 增加的幅度尽可能的小，这样才满足“下一个排列与当前排列紧邻“的要求。为了满足这个要求，我们需要：
        1. 在尽可能靠右的低位进行交换，需要从后向前查找
        2. 将一个尽可能小的「大数」与前面的「小数」交换。比如123465，下一个排列应该把 5 和 4 交换而不是把 6 和 4 交换
        3. 将「大数」换到前面后，需要将「大数」后面的所有数 重置为升序，升序排列就是最小的排列。以 123465 为例：
              首先按照上一步，交换 5 和 4，得到 123564；然后需要将 5 之后的数重置为升序，得到 123546。显然 123546 比 123564 更小，123546 就是 123465 的下一个排列
        4. 以上就是求 “下一个排列” 的分析过程。
        
    算法过程
    标准的 “下一个排列” 算法可以描述为：
    
        从后向前 查找第一个 相邻升序 的元素对 (i,j)，满足 A[i] < A[j]。此时 [j,end) 必然是降序
        在 [j,end) 从后向前 查找第一个满足 A[i] < A[k] 的 k。A[i]、A[k] 分别就是上文所说的「小数」、「大数」
        将 A[i] 与 A[k] 交换
        可以断定这时 [j,end) 必然是降序，逆置 [j,end)，使其升序
        如果在步骤 1 找不到符合的相邻元素对，说明当前 [begin,end) 为一个降序顺序，则直接跳到步骤 4`

    """
    if len(nums) <= 1:
        return

    i = len(nums) - 2
    #  1. 倒序遍历, 找到第一个数, 这个数比后面的数小;
    while i >= 0:
        if nums[i] < nums[i + 1]: break
        i -= 1

    # 2. 此时, i之后的数满足降序排列, 所以，倒序遍历, 找到第一个数, 这个数比nums[i]大 然后交换;
    if i > 0:
        j = len(nums) - 1
        while j > 0 and nums[i] >= nums[j]:
            j -= 1

        # 交换 nums[i] 和 nums[j]
        nums[i], nums[j] = nums[j], nums[i]

    # 3. 将i后面的数升序排列, 只需要对撞双指针交换即可(因为i后面的数时降序的)
    left, right = i + 1, len(nums) - 1
    while left < right:
        nums[left], nums[right] = nums[right], nums[left]
        left += 1
        right -= 1



if __name__ == '__main__':
    # nums = [1, 2, 3, 4, 6, 5]
    nums = [3, 2, 1]
    nextPermutation(nums)
    print(nums)















